In [2]:
import pandas as pd

In [3]:
data={"a":[1,2,3,4],
      "b":[5,6,7,8],
      "c":['suhas','avinash','vishal','krish']

   }

In [4]:
data

{'a': [1, 2, 3, 4],
 'b': [5, 6, 7, 8],
 'c': ['suhas', 'avinash', 'vishal', 'krish']}

In [5]:
df=pd.DataFrame(data)

In [6]:
df

   a  b        c
0  1  5    suhas
1  2  6  avinash
2  3  7   vishal
3  4  8    krish

Set and Reset indexes

In [7]:
df.set_index('c')

         a  b
c
suhas    1  5
avinash  2  6
vishal   3  7
krish    4  8

In [8]:
df

   a  b        c
0  1  5    suhas
1  2  6  avinash
2  3  7   vishal
3  4  8    krish

In [9]:
df.set_index('c', inplace=True)

In [10]:
df

         a  b
c
suhas    1  5
avinash  2  6
vishal   3  7
krish    4  8

In [11]:
df.reset_index()

         c  a  b
0    suhas  1  5
1  avinash  2  6
2   vishal  3  7
3    krish  4  8

In [12]:
df.reset_index(inplace=True)

In [13]:
df

         c  a  b
0    suhas  1  5
1  avinash  2  6
2   vishal  3  7
3    krish  4  8

In [14]:
def test(x):
    return x.sum()
df.apply(test, axis=0)

c    suhasavinashvishalkrish
a                         10
b                         26
dtype: object

In [15]:
df1=df[['a','b']]

In [16]:
df1

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [17]:
df1.applymap(lambda x:x**2)

    a   b
0   1  25
1   4  36
2   9  49
3  16  64

In [18]:
df.sort_values('c')

         c  a  b
1  avinash  2  6
3    krish  4  8
0    suhas  1  5
2   vishal  3  7

In [19]:
df.sort_index(ascending=False)

         c  a  b
3    krish  4  8
2   vishal  3  7
1  avinash  2  6
0    suhas  1  5

In [20]:
# Python pandas - Window functions

In [21]:
df1=pd.DataFrame({"a": [1,2,3,4,5,6,7,8]})

In [22]:
df1

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

In [23]:
df1.rolling(window=1).mean()

     a
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0

In [24]:
df1.rolling(window=2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5

In [25]:
df1.rolling(window=3).mean()

     a
0  NaN
1  NaN
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0

In [26]:
df1.cumsum()

    a
0   1
1   3
2   6
3  10
4  15
5  21
6  28
7  36

In [27]:
data=pd.date_range(start='21-02-2020', end='21-05-2020')

/tmp/ipykernel_70/3764660966.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  data=pd.date_range(start='21-02-2020', end='21-05-2020')

In [28]:
data

DatetimeIndex(['2020-02-21', '2020-02-22', '2020-02-23', '2020-02-24',
               '2020-02-25', '2020-02-26', '2020-02-27', '2020-02-28',
               '2020-02-29', '2020-03-01', '2020-03-02', '2020-03-03',
               '2020-03-04', '2020-03-05', '2020-03-06', '2020-03-07',
               '2020-03-08', '2020-03-09', '2020-03-10', '2020-03-11',
               '2020-03-12', '2020-03-13', '2020-03-14', '2020-03-15',
               '2020-03-16', '2020-03-17', '2020-03-18', '2020-03-19',
               '2020-03-20', '2020-03-21', '2020-03-22', '2020-03-23',
               '2020-03-24', '2020-03-25', '2020-03-26', '2020-03-27',
               '2020-03-28', '2020-03-29', '2020-03-30', '2020-03-31',
               '2020-04-01', '2020-04-02', '2020-04-03', '2020-04-04',
               '2020-04-05', '2020-04-06', '2020-04-07', '2020-04-08',
               '2020-04-09', '2020-04-10', '2020-04-11', '2020-04-12',
               '2020-04-13', '2020-04-14', '2020-04-15', '2020-04-16',
               '2020-04-17', '2020-04-18', '2020-04-19', '2020-04-20',
               '2020-04-21', '2020-04-22', '2020-04-23', '2020-04-24',
               '2020-04-25', '2020-04-26', '2020-04-27', '2020-04-28',
               '2020-04-29', '2020-04-30', '2020-05-01', '2020-05-02',
               '2020-05-03', '2020-05-04', '2020-05-05', '2020-05-06',
               '2020-05-07', '2020-05-08', '2020-05-09', '2020-05-10',
               '2020-05-11', '2020-05-12', '2020-05-13', '2020-05-14',
               '2020-05-15', '2020-05-16', '2020-05-17', '2020-05-18',
               '2020-05-19', '2020-05-20', '2020-05-21'],
              dtype='datetime64[ns]', freq='D')

In [29]:
df2=pd.DataFrame({'date':data})

In [30]:
df2

         date
0  2020-02-21
1  2020-02-22
2  2020-02-23
3  2020-02-24
4  2020-02-25
..        ...
86 2020-05-17
87 2020-05-18
88 2020-05-19
89 2020-05-20
90 2020-05-21

[91 rows x 1 columns]

In [31]:
df2.dtypes

date    datetime64[ns]
dtype: object

In [32]:
df3=pd.DataFrame({'date':['2020-05-20','2020-05-19','2020-05-18']})

In [33]:
df3

         date
0  2020-05-20
1  2020-05-19
2  2020-05-18

In [34]:
df3.dtypes

date    object
dtype: object

In [35]:
#In scenario where need to convert object to datetime datatype

In [36]:
df3['update_date']=pd.to_datetime(df3['date'])

In [37]:
df3

         date update_date
0  2020-05-20  2020-05-20
1  2020-05-19  2020-05-19
2  2020-05-18  2020-05-18

In [38]:
df3.dtypes

date                   object
update_date    datetime64[ns]
dtype: object

In [41]:
df3['update_date']=pd.to_datetime(df3['date']).dt.year

In [42]:
df3

         date  update_date
0  2020-05-20         2020
1  2020-05-19         2020
2  2020-05-18         2020